# *Задача 2:*
# Найдите сумму цифр трехзначного числа. 

# *Пример:*
# 123 -> 6 (1 + 2 + 3)
# 100 -> 1 (1 + 0 + 0) |

c = int(input("Введите трехзначное число: "))

с1 =  c // 100
с2 = c // 10 - с1 * 10
с3 = c - с1 * 100 - с2 * 10
print(f"{c} -> {с1 + с2 + с3} ({с1} + {с2} + {с3})")
print(f"Сумма цифр введённого числа равна {с1 + с2 + с3}")

# или

# print(f"Сумма цифр введённого числа равна {int(c[0]) + int(c[1]) + int(c[2])}")
# print(f"{c} -> {int(c[0]) + int(c[1]) + int(c[2])} ({c[0]} + {c[1]} + {c[2]})")